//1. Какое будет выведено значение: let x = 5; alert( x++ ); ?
	ответ: 5;

//2. Чему равно такое выражение: [ ] + false - null + true ?
	ответ: NaN;

//3. Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
	ответ: x = 2;

//4. Чему равна сумма [ ] + 1 + 2?
	ответ: '12'; //string

//5. Что выведет этот код: alert( "1"[0] )?
	ответ: '1'; //string

//6. Чему равно 2 && 1 && null && 0 && undefined ?
	ответ: null; 

//7. Есть ли разница между выражениями? !!( a && b ) и (a && b)?
	ответ: Есть;

//8. Что выведет этот код: alert( null || 2 && 3 || 4 ); ?
	ответ: 3;


//9. a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?
	ответ: нет; сравниваются ссылки на arr, а не содержимое.
	При создании строки с arr они true;

//10. Что выведет этот код: alert( +"Infinity" ); ?

//11. Верно ли сравнение: "Ёжик" > "яблоко"?

//12. Чему равно 0 || "" || 2 || undefined || true || falsе ?